[
  {"text": "We're an SEO agency looking for backend operational improvements. Budget: $5K/month. Open to exploring options."},
  {"text": "hello"},
  {"text": "Can you do it?"},
  {"text": "I run a niche real estate business and need consulting to scale beyond my local market. Budget $12K/month. Can we talk?"},
  {"text": "Hey, we run a SaaS startup making $20,000 per month and want to scale to $100K. Budget is $10K per month. Can you help?"},
  {"text": "Hey, can you guys help us set up a new business from scratch? Not scaling, but launching?"},
  {"text": "We own an insurance brokerage and are struggling to scale. Budget: $10K/month, need help structuring our sales process."},
  {"text": "Need to talk. Call me."},
  {"text": "Our accounting firm, TaxPro Experts, wants to improve efficiency and lead generation. Budget: $5K/month. What do you suggest?"},
  {"text": "Can we set up a call to discuss our scaling needs? I prefer discussing details in person."},
  {"text": "Hi, I run an AI consulting firm and need help structuring my client acquisition process. Budget is $10K/month."},
  {"text": "How does it work?"},
  {"text": "I have an eCommerce brand making $50K per month. Looking to streamline fulfillment and increase profitability. Open to strategies."},
  {"text": "We are a law firm specializing in startups and looking for better lead generation strategies. Budget is around $8K monthly."},
  {"text": "Hey, I own a coaching business for high-ticket clients. Revenue is $40K/month, but need to systematize client fulfillment."},
  {"text": "I’m interested in your service, but before sharing details, I’d like to meet your team first."},
  {"text": "Marketing agency here. We manage $100K in monthly ad spend but struggle with client retention. Can you help us fix processes?"},
  {"text": "I’m looking for business coaching, but not sure what I need yet. Can you guide me on what’s best for me?"},
  {"text": "Hey, we run Elite Growth Media, a B2B lead generation agency. Revenue is $30K/month, looking to scale past $100K. Need consulting for growth systems."},
  {"text": "We run a franchise business and need a better hiring and management system. Budget is flexible, just need a scalable plan."},
  {"text": "We have an influencer marketing agency and want to explore collaboration rather than consulting. Are you open to that?"},
  {"text": "I run a niche subscription box business. Making $12K/month but struggling with churn. Need strategies to increase retention."},
  {"text": "Who is this?"},
  {"text": "We run a B2B SaaS company, currently at $80K/month. Looking for guidance on hiring and operations."},
  {"text": "We own a fitness coaching business and need better lead generation. Our budget is $5,000 monthly, but revenue is unstable."},
  {"text": "Do you do marketing?"},
  {"text": "Our accounting firm, LedgerFix, is expanding but struggling with fulfillment. Looking for advice on structuring teams. Budget: $7K/month."},
  {"text": "We have a startup in the health & wellness space. Need an audit of our business model. Budget: $7K/month."},
  {"text": "We are scaling our eCommerce brand past $1M/year, but need fulfillment optimization. Budget $15K/month."},
  {"text": "We want a partnership opportunity to integrate your consulting with our platform. Are you open to that?"},
  {"text": "I run a consulting business and I’m overwhelmed with operational inefficiencies. Budget: $20K/month, looking for solutions."},
  {"text": "Hi, my business generates $500K/year but my team is overwhelmed. Need consulting on optimizing our workflow. Urgent need."},
  {"text": "Hey, I’m exploring ways to increase revenue for my online coaching program. Budget is about $5K/month."},
  {"text": "I need help with something urgent."},
  {"text": "We're a real estate firm specializing in commercial sales. Monthly budget is $8,000, need help with scaling operations."},
  {"text": "I run a Facebook Ads agency but my team is stretched thin. We’re bringing in $25K/month, need operational fixes ASAP."},
  {"text": "Hello, I want to grow my Shopify brand. We do $200K/year, but need better marketing systems. Budget: $3,000/month."},
  {"text": "We run a digital agency with 5 employees and need help building a more efficient client acquisition system. Budget: $15K/month."},
  {"text": "Hey, I run ScaleUp Media, a high-ticket marketing agency. Revenue: $60K/month. Need advice on team scaling and SOPs."}
]
